from aiogram.fsm.state import StatesGroup, State

# Стан машини станів для FSM
class FSMOrder(StatesGroup):
    load_location = State()
    drop_location = State()
    car_type = State()
    hours = State()
    phone = State()
    confirm = State()
    work_type = State()
    util_info = State()

# Мінімальні години по авто
MIN_HOURS = {
    "Бус до 1,5 т до 13м3": 2,
    "Бус максі база до 2 т до 15 м3": 2,
    "Фургон до 2 т до 20 м3": 2,
    "Фургон до 2 т до 20 м3 з гідробортом": 3,
    "Фургон до 3 т гідроборт до 30м3": 3,
    "Фургон 5т гідроборт до 40м3": 3,
    "Фургон до 10т до 70м3": 3,
    "Інше авто": 3
}

# Ціни по місту (за годину)
CITY_PRICES = {
    "Бус до 1,5 т до 13м3": 450,
    "Бус максі база до 2 т до 15 м3": 450,
    "Фургон до 2 т до 20 м3": 650,
    "Фургон до 2 т до 20 м3 з гідробортом": 700,
    "Фургон до 3 т гідроборт до 30м3": 640,
    "Фургон 5т гідроборт до 40м3": 850
    # Інше авто та до 10т — по домовленості
}

# Ціни за містом (за км × 2)
OUT_CITY_PRICES = {
    "Бус до 1,5 т до 13м3": 20,
    "Бус максі база до 2 т до 15 м3": 20,
    "Фургон до 2 т до 20 м3": 25,
    "Фургон до 2 т до 20 м3 з гідробортом": 25,
    "Фургон до 3 т гідроборт до 30м3": 27,
    "Фургон 5т гідроборт до 40м3": 27
}
