from geopy.distance import geodesic
from config import LVIV_CENTER, CITY_RADIUS_KM

CITY_PRICES = {
    "Бус до 1,5 т до 13м3": 450,
    "Бус максі база до 2 т до 15 м3": 450,
    "Фургон до 2 т до 20 м3": 650,
    "Фургон до 2 т до 20 м3 з гідробортом": 700,
    "Фургон до 3 т гідроборт до 30м3": 640,
    "Фургон 5т гідроборт до 40м3": 850,
    # "Фургон до 10т до 70м3" і "Інше авто" — по домовленості
}

OUT_CITY_PRICES = {
    "Бус до 1,5 т до 13м3": 20,
    "Бус максі база до 2 т до 15 м3": 20,
    "Фургон до 2 т до 20 м3": 25,
    "Фургон до 2 т до 20 м3 з гідробортом": 25,
    "Фургон до 3 т гідроборт до 30м3": 27,
    "Фургон 5т гідроборт до 40м3": 27,
    # "Фургон до 10т до 70м3" і "Інше авто" — по домовленості
}

MIN_HOURS = {
    "Бус до 1,5 т до 13м3": 2,
    "Бус максі база до 2 т до 15 м3": 2,
    "Фургон до 2 т до 20 м3": 2,
    "Фургон до 2 т до 20 м3 з гідробортом": 3,
    "Фургон до 3 т гідроборт до 30м3": 3,
    "Фургон 5т гідроборт до 40м3": 3,
    "Фургон до 10т до 70м3": 3,
    "Інше авто": 3
}

def is_within_city(location: tuple[float, float]) -> bool:
    """Чи координати входять у радіус 10 км від центру Львова"""
    return geodesic(location, LVIV_CENTER).km <= CITY_RADIUS_KM
